app/Controllers/Dosen.php

    public function select_peserta(){
        $model = new UserModel();
        $data = $model->where('level',3)->findAll();
---
SELECT *
FROM `users`
WHERE `level` = 3
AND `users`.`deleted_at` IS NULL

    public function select_pengajar(){
        $model = new UserModel();
        $data = $model->where('level',2)->findAll();
---
SELECT *
FROM `users`
WHERE `level` = 2
AND `users`.`deleted_at` IS NULL