app/Controllers/GetId.php

    public function getMateri($id = null)
    {
        $model = new MateriModel();
        $data = $model->getWhere(['id_pertemuan' => $id])->getResult();
---
SELECT *
FROM `materi`
WHERE `id_pertemuan` = '32'

    public function getTugas($id = null)
    {
        $model = new TugasModel();
        $data = $model->getWhere(['id_pertemuan' => $id])->getResult();
---
SELECT *
FROM `tugas`
WHERE `id_pertemuan` = '81'