app/Controllers/Kelas.php

    public function index()
    {
        $model = new KelasModel();
        $data = $model->findAll();
---
SELECT *
FROM `kelas`
WHERE `kelas`.`deleted_at` IS NULL