app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'Mutia'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function auth(){
        helper(['form']);
        $session = session();
        $model = new UserModel();
        $username = $this->request->getVar('username');
        //$email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $level = $this->request->getVar('level');
        $data = $model->where('username', $username)->first();