app/Controllers/Materi.php

SELECT *
FROM `materi`
WHERE `id_pertemuan` = '69'
---
    public function getMateri($id = null)
    {
        $model = new MateriModel();
        $data = $model->getWhere(['id_pertemuan' => $id])->getResult();