app/Controllers/Nilai.php

    public function grafik_tidaklulus()
    {
        $model = new NilaiModel();
        $data = $model->grafiktidaklulus()->getResult();
---
SELECT *
FROM `nilai`

    public function index()
    {
        $model = new NilaiModel();
        $data = $model->findAll();
---
SELECT *
FROM `nilai`