app/Controllers/Pertemuan.php

SELECT *
FROM `pertemuan`
---
    public function index()
    {
        $model = new PertemuanModel();
        $data = $model->findall();