app/Controllers/Tugas.php

    public function index()
    {
        $model = new TugasModel();
        $data = $model->findAll();
---
SELECT *
FROM `tugas`