app/Models/KomentarModel.php

SELECT `nama_pertemuan`, `catatan`, `nama`
FROM `posting`
JOIN `pertemuan` ON `posting`.`id_pertemuan` = `pertemuan`.`id`
JOIN `users` ON `posting`.`id_users` = `users`.`id`
WHERE `id_pertemuan` = '43'
---
    public function getNama($id = null){
        $builder = $this->db->table('posting');
        $builder->select('posting.id, nama_pertemuan, catatan, nama, nik');
        $builder->join('pertemuan','posting.id_pertemuan = pertemuan.id');
        $builder->join('users','posting.id_users = users.id');
        $builder->Where(['id_pertemuan'=>$id]);
        $data = $builder->get();