app/Models/MateriModel.php

SELECT `nama_pertemuan`, `judul`, `dokumen`
FROM `materi`
JOIN `pertemuan` ON `materi`.`id_pertemuan` = `pertemuan`.`id`
WHERE `id_pertemuan` = '43'
---
    public function joindata(){
        $builder = $this->db->table('materi');
        $builder->select('nama_pertemuan,judul,dokumen');
        $builder->join('pertemuan','materi.id_pertemuan = pertemuan.id');
        $data = $builder->get();