app/Models/NilaiModel.php

    public function getnilai($id = null){
        $builder = $this->db->table('nilai');
        $builder->select('nilai.id,nama,judul,nilai,status');
        $builder->join('users','nilai.id_peserta =  users.id');
        $builder->join('tugas','nilai.id_tugas = tugas.id');
        $builder->Where(['id_tugas' => $id]);
        $data = $builder->get();
---
SELECT `nama`, `judul`, `nilai`, `status`
FROM `nilai`
JOIN `users` ON `nilai`.`id_peserta` =  `users`.`id`
JOIN `tugas` ON `nilai`.`id_tugas` = `tugas`.`id`
WHERE `id_tugas` = '4'