app/Models/PertemuanModel.php

    public function nama_pengajar($id = null){
        $builder = $this->db->table('pertemuan');
        $builder->select('nama,nama_kelas,nama_pertemuan,tanggal_pertemuan,deskripsi_pertemuan,tempat,sub_cp,materi,indikator,metode_penilaian,
                        metode_pembelajaran,pustaka,bobot,link,upload_image');
        $builder->join('users','pertemuan.id_pengajar =  users.id');
        $builder->join('kelas','pertemuan.id_kelas = kelas.id');
        $builder->getWhere(['id_kelas'=>$id]);
        $data = $builder->get();
---
SELECT `nama`, `nama_kelas`, `nama_pertemuan`, `tanggal_pertemuan`, `deskripsi_pertemuan`, `tempat`, `sub_cp`, `materi`, `indikator`, `metode_penilaian`, `metode_pembelajaran`, `pustaka`, `bobot`, `link`, `upload_image`
FROM `pertemuan`
JOIN `users` ON `pertemuan`.`id_pengajar` =  `users`.`id`
JOIN `kelas` ON `pertemuan`.`id_kelas` = `kelas`.`id`
WHERE `id_kelas` IS NULL
SELECT *
FROM `pertemuan`

    public function getNama(){
        $builder = $this->db->table('pertemuan');
        $builder->select('pertemuan.id, id_kelas, id_pengajar, nama,nama_pertemuan,tanggal_pertemuan,deskripsi_pertemuan,tempat,sub_cp,materi,indikator,metode_penilaian,
        metode_pembelajaran,pustaka,bobot,link,upload_image');
        $builder->join('users','pertemuan.id_pengajar = users.id');
        $builder->Where('pertemuan.deleted_at IS NULL',NULL,false);
        $data = $builder->get();
---
SELECT `pertemuan`.`id`, `id_kelas`, `id_pengajar`, `nama`, `nama_pertemuan`, `tanggal_pertemuan`, `deskripsi_pertemuan`, `tempat`, `sub_cp`, `materi`, `indikator`, `metode_penilaian`, `metode_pembelajaran`, `pustaka`, `bobot`, `link`, `upload_image`
FROM `pertemuan`
JOIN `users` ON `pertemuan`.`id_pengajar` = `users`.`id`
WHERE pertemuan.deleted_at IS NULL

    public function getbyidkelas($id = null){
        $builder = $this->db->table('pertemuan');
        $builder->select('nama,nama_pertemuan,tanggal_pertemuan,deskripsi_pertemuan,tempat,sub_cp,materi,indikator,metode_penilaian,
        metode_pembelajaran,pustaka,bobot,link,upload_image');
        $builder->join('users','pertemuan.id_pengajar = users.id');
        $builder->getWhere(['id_kelas'=>$id] );
        $data = $builder->get();
---
SELECT `nama`, `nama_pertemuan`, `tanggal_pertemuan`, `deskripsi_pertemuan`, `tempat`, `sub_cp`, `materi`, `indikator`, `metode_penilaian`, `metode_pembelajaran`, `pustaka`, `bobot`, `link`, `upload_image`
FROM `pertemuan`
JOIN `users` ON `pertemuan`.`id_pengajar` = `users`.`id`
WHERE `id_kelas` = '54'
SELECT *
FROM `pertemuan`