app/Models/TugasPesertaModel.php

    public function getNama($id = null){
        $builder = $this->db->table('tugas_peserta');
        $builder->select('tugas_peserta.id,nama, dokumen');
        $builder->join('users','tugas_peserta.id_users = users.id');
        $builder->Where(['id_tugas'=>$id]);
        $data = $builder->get();
---
SELECT `nama`, `dokumen`
FROM `tugas_peserta`
JOIN `users` ON `tugas_peserta`.`id_users` = `users`.`id`
WHERE `id_tugas` = '15'